In [6]:
import pandas as pd
import numpy as np

In [14]:
import seaborn as sns
titanic = sns.load_dataset("titanic")
titanic.head(20)
titanic.count()

survived       891
pclass         891
sex            891
age            714
sibsp          891
parch          891
fare           891
embarked       889
class          891
who            891
adult_male     891
deck           203
embark_town    889
alive          891
alone          891
dtype: int64

In [7]:
np.random.seed(1)
s2 = pd.Series(np.random.randint(6, size=100))
s2.tail()

95    4
96    5
97    2
98    4
99    3
dtype: int32

In [8]:
s2.value_counts()    # value(값)의 카운트

1    22
0    18
4    17
5    16
3    14
2    13
dtype: int64

In [11]:
np.random.seed(2)
df = pd.DataFrame(np.random.randint(5, size=(4, 4)), dtype=float)
df.iloc[2, 3] = np.nan
df

     0    1    2    3
0  0.0  0.0  3.0  2.0
1  3.0  0.0  2.0  1.0
2  3.0  2.0  4.0  NaN
3  4.0  3.0  4.0  2.0

In [12]:
df[0].value_counts()      #df의 열[0]의 값의 카운트

3.0    2
4.0    1
0.0    1
Name: 0, dtype: int64

In [16]:
titanic['age'].value_counts().head(5)     # titanic 의 age열 값의 카운트

24.0    30
22.0    27
18.0    26
19.0    25
30.0    25
Name: age, dtype: int64

In [19]:
s2.value_counts().sort_index()     #  인덱스 값으로 솔트

0    18
1    22
2    13
3    14
4    17
5    16
dtype: int64

In [22]:
s = pd.Series(range(10))
s[3] = np.nan
s

0    0.0
1    1.0
2    2.0
3    NaN
4    4.0
5    5.0
6    6.0
7    7.0
8    8.0
9    9.0
dtype: float64

In [23]:
s.sort_values()      # s를 밸류값으로 sort 하면 NaN값은 맨 밑으로 정렬됨

0    0.0
1    1.0
2    2.0
4    4.0
5    5.0
6    6.0
7    7.0
8    8.0
9    9.0
3    NaN
dtype: float64

In [24]:
s.sort_values(ascending=False)      # 내림차순 정렬 ascending = False

9    9.0
8    8.0
7    7.0
6    6.0
5    5.0
4    4.0
2    2.0
1    1.0
0    0.0
3    NaN
dtype: float64

In [25]:
df.sort_values(by=1)

     0    1    2    3
0  0.0  0.0  3.0  2.0
1  3.0  0.0  2.0  1.0
2  3.0  2.0  4.0  NaN
3  4.0  3.0  4.0  2.0

In [26]:
np.random.seed(1)
df2 = pd.DataFrame(np.random.randint(10, size=(4, 8)))
df2

   0  1  2  3  4  5  6  7
0  5  8  9  5  0  0  1  7
1  6  9  2  4  5  2  4  2
2  4  7  7  9  1  7  0  6
3  9  9  7  6  9  1  0  1

In [27]:
df2.sum(axis=1)

0    35
1    34
2    41
3    42
dtype: int64

In [30]:
df2["RowSum"] = df2.sum(axis=1)
df2

   0  1  2  3  4  5  6  7  RowSum
0  5  8  9  5  0  0  1  7      70
1  6  9  2  4  5  2  4  2      68
2  4  7  7  9  1  7  0  6      82
3  9  9  7  6  9  1  0  1      84

In [29]:
df2.sum()

0          24
1          33
2          25
3          24
4          15
5          10
6           5
7          16
RowSum    152
dtype: int64

In [38]:
df2.loc["ColTotal", :] = df2.sum()
df2

              0      1      2      3      4     5     6      7  RowSum
0           5.0    8.0    9.0    5.0    0.0   0.0   1.0    7.0    70.0
1           6.0    9.0    2.0    4.0    5.0   2.0   4.0    2.0    68.0
2           4.0    7.0    7.0    9.0    1.0   7.0   0.0    6.0    82.0
3           9.0    9.0    7.0    6.0    9.0   1.0   0.0    1.0    84.0
ColTotal  192.0  264.0  200.0  192.0  120.0  80.0  40.0  128.0  2432.0

In [39]:
df3 = pd.DataFrame({
    'A': [1, 3, 4, 3, 4],
    'B': [2, 3, 1, 2, 3],
    'C': [1, 5, 2, 4, 4]
})
df3

   A  B  C
0  1  2  1
1  3  3  5
2  4  1  2
3  3  2  4
4  4  3  4

In [40]:
df3.apply(lambda x: x.max() - x.min())

A    3
B    2
C    4
dtype: int64

In [41]:
df3.apply(pd.value_counts)

     A    B    C
1  1.0  1.0  1.0
2  NaN  2.0  1.0
3  2.0  2.0  NaN
4  2.0  NaN  2.0
5  NaN  NaN  1.0

In [42]:
df3.apply(pd.value_counts).fillna(0).astype(int)

   A  B  C
1  1  1  1
2  0  2  1
3  2  2  0
4  2  0  2
5  0  0  1

In [45]:
ages = [0, 2, 10, 21, 23, 37, 31, 61, 20, 41, 32, 100]
ages

[0, 2, 10, 21, 23, 37, 31, 61, 20, 41, 32, 100]

In [46]:
bins = [1, 15, 25, 35, 60, 99]
labels = ["미성년자", "청년", "중년", "장년", "노년"]
cats = pd.cut(ages, bins, labels=labels)
cats

[NaN, 미성년자, 미성년자, 청년, 청년, ..., 노년, 청년, 장년, 중년, NaN]
Length: 12
Categories (5, object): [미성년자 < 청년 < 중년 < 장년 < 노년]

In [47]:
type(cats)

pandas.core.arrays.categorical.Categorical